{
    "trial1":{
        "content":"Below I will input a complete story composed by some scenarios. Every scenario including conversation and the background of the conversation between {main_character} and supporting characters.  These scenarios are to test the theory of mind reasoning abilities of four mental states: belief, emotion, intention, action.[characters]{character_information}[story]{complete_story}[mental states analysis in every scenario]{mental_states_analysis_in_every_scenario}[Analysis of Mental States Across Scenarios]\n{analysis_of_mental_states_across_scenarios}\nI want you to extract {number_of_question} questions from these scenarios to test if the readers have the theory of mind reasoning abilities. 1. you should provided 1 types of questions. type2: in every scenario, ask how the mental states influence each other.The number of question type2 should be {number_of_question}. 2.These questions are multi-choices questions, every question include:a. question, b. options, c. true answer, d. question type. 3.The [mental states analysis in every scenario] and [Analysis of Mental States Across Scenarios] provided the analysis of mental States in one scenario or across scenarios. 4. apart from the true answer, options should be misleading enough to make the question as hard as possible. 5. The total number of questions should be: {number_of_question}. 6. respond the questions in JSON format:{json_format}. 7.every option start with a, b, c, and d.... 8.The True answer should be only be a, b, c or d; you do not need to print the content of the option. 9. Respond all the {number_of_question} questions all at once. 9. to make the question harder, you can make the wrong options very simlar to the true answer, only changing some key words. You can also generate some trap questions. for example: if one mental states do not change, you can ask why the mental states change; but in fact, the mental states do not change; so the true answer is that the mental states do not change.10. to make the question harder, you can:a. Generalizing (understanding of sentences). Mainly refers to replacing the whole with the part, replacing the whole with the part; or replacing the part with the whole, and replacing the individual with the general.Therefore, add modifiers and restrictive words before important words, such as 'some', 'almost','except...', 'until...', 'most', 'all', etc. b. Making something out of nothing (screening and integration of information). It means that the content mentioned in the given options is not involved in the original material and cannot be inferred from the original text. c. Putting the wrong hat on the wrong head (concept). Mainly refers to deliberately mistaking the object in the options to confuse the reader. d. Cause and effect confusion. There are generally two situations of cause and effect confusion: one is the reversal of cause and effect, that is, misjudging 'cause' as 'effect' and 'effect' as 'cause', reversing the relationship between the two; the other is imposing cause and effect, that is, saying that there is no causal relationship as a causal relationship. e. Reversing the main and the secondary. The changes and developments of things have major and minor contradictions in terms of contradictions, major and minor causes in terms of causes, and major and minor aspects in terms of manifestations. When designing traps, these 'major' and 'minor' aspects are reversed. f. Confusing time. Calling things that have not yet been determined or realized in the original text as fait accompli. g. Information omission. When setting a 'trap', the questioner deliberately omits essential information in the original text, resulting in incomplete information. h. Misinterpretation of the original meaning. It means that the understanding of words and sentences deviates from the original meaning, misinterpreting the original text's point of view or meaning to be expressed.i. Unclear reference. It means that the reference content of the pronoun is vague, unclear, or even wrong. j. Logical error. It mainly refers to the questioner setting traps from the perspective of logical reasoning when setting options for reasonable inferences and imagination questions based on the original content. There are two ways to ask logical error types.First, the conditions are insufficient.Second, the necessary conditions are regarded as sufficient and necessary conditions.k. Answering irrelevant questions. This means that the options are completely irrelevant to the question stem, and the answer is detached from the question.l. Quoting out of context.m. Substituting concepts"
    }
}