{
    "trail1":"[character information]:{characters_information}\n I want to generate a complete and complex story including {scenario_number} scenarios, every scenario including dialogue and the background of the dialogue between {main_character} and supporting characters. These scenarios are to test the readers' theory of mind reasoning abilities in four mental states:belief, emotion, intention, action. The four mental states will influence each other. You do not need to generate the complete story and scenarios. But you could help me to:1. describe the relationship between the {main_character} and other provided characters.2.design what the belief, emotion, intention, and action are of the {main_character} in every scenario when {main_character} interacts with supporting characters. 3.The mental states in the previous scenario may influence the mental states in the following scenarios. The changes of mental states are caused both by previous mental states and the plot. 4.I want the mental states' change is complex enough: at least one mental states of [belief, emotion, intention] changes in all scenarios. You should also describe how each mental states influence each other.The format should be:[scenario number]:[belief]:[emotion]:[intention]:[action]:[influence]:[how mental states influence each other] 5. After step 1-4, you should analyze all mental states of {main_character}: if changed between scenarios, you should also provide the main plot and previous mental states that cause the mental states' change. The format should be: [belief]: [if changed: True or False], [if changed] [scenario number]:[mental state's value]->[scenario number]:[mental state's value]->[scenario number]:[mental state's value] …Reasons: [scenario number]->[scenario number]:[reason];[scenario number]->[scenario number]:[reason]…[emotion]: the format is the same as [belief].[intention]: the format is the same as [belief] 6.the interaction in every scenario should between the {main_character} and supporting characters. 7.Respond with JSON format:{JSON_format}"
}
